simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CapSense_v2_0/API/CapSense_SensingCSX_LL.h
/***************************************************************************//**
* \file `$INSTANCE_NAME`_SensingCSX_LL.h
* \version `$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION`
*
* \brief
*   This file provides the headers of APIs specific to CSX sensing implementation.
*
* \see `$INSTANCE_NAME` v`$CY_MAJOR_VERSION`.`$CY_MINOR_VERSION` Datasheet
*
*//*****************************************************************************
* Copyright (2016-2017), Cypress Semiconductor Corporation.
********************************************************************************
* This software is owned by Cypress Semiconductor Corporation (Cypress) and is
* protected by and subject to worldwide patent protection (United States and
* foreign), United States copyright laws and international treaty provisions.
* Cypress hereby grants to licensee a personal, non-exclusive, non-transferable
* license to copy, use, modify, create derivative works of, and compile the
* Cypress Source Code and derivative works for the sole purpose of creating
* custom software in support of licensee product to be used only in conjunction
* with a Cypress integrated circuit as specified in the applicable agreement.
* Any reproduction, modification, translation, compilation, or representation of
* this software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: CYPRESS MAKES NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, WITH
* REGARD TO THIS MATERIAL, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
* Cypress reserves the right to make changes without further notice to the
* materials described herein. Cypress does not assume any liability arising out
* of the application or use of any product or circuit described herein. Cypress
* does not authorize its products for use as critical components in life-support
* systems where a malfunction or failure may reasonably be expected to result in
* significant injury to the user. The inclusion of Cypress' product in a life-
* support systems application implies that the manufacturer assumes all risk of
* such use and in doing so indemnifies Cypress against all charges. Use may be
* limited by and subject to the applicable Cypress software license agreement.
*******************************************************************************/

#if !defined(`$INSTANCE_NAME`_SENSING_CSX_LL_H)
#define `$INSTANCE_NAME`_SENSING_CSX_LL_H

#include "syslib/cy_syslib.h"
#include "`$INSTANCE_NAME`_Structure.h"
#include "`$INSTANCE_NAME`_Configuration.h"

#if (`$INSTANCE_NAME`_CSX_EN == 1u)

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_LOW_LEVEL
* \addtogroup group_cysense_low_level
* \{
*/

void `$INSTANCE_NAME`_CSXSetupWidget(uint32 widgetId);
void `$INSTANCE_NAME`_CSXSetupWidgetExt(uint32 widgetId, uint32 sensorId);
void `$INSTANCE_NAME`_CSXScan(void);
void `$INSTANCE_NAME`_CSXScanExt(void);

#if (`$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN == `$INSTANCE_NAME`_ENABLE)
    void `$INSTANCE_NAME`_CSXCalibrateWidget(uint32 widgetId, uint16 target);
#endif /* (`$INSTANCE_NAME`_CSX_IDAC_AUTOCAL_EN == `$INSTANCE_NAME`_ENABLE) */

void `$INSTANCE_NAME`_CSXConnectTx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *txPtr);
void `$INSTANCE_NAME`_CSXConnectRx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *rxPtr);
void `$INSTANCE_NAME`_CSXDisconnectTx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *txPtr);
void `$INSTANCE_NAME`_CSXDisconnectRx(`$INSTANCE_NAME`_FLASH_IO_STRUCT const *rxPtr);

/** \}
* \endcond */

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
/**
* \cond SECTION_CYSENSE_INTERNAL
* \addtogroup group_cysense_internal
* \{
*/

void `$INSTANCE_NAME`_CSXInitialize(void);
void `$INSTANCE_NAME`_CSXElectrodeCheck(void);
uint32 `$INSTANCE_NAME`_SsCSXGetTxClkDivider(uint32 widgetId);

/** \}
* \endcond */

/* The interrupt handler of the CSX sensing module */
void `$INSTANCE_NAME`_CSXScanISR(void);

/*******************************************************************************
* Global variables exposed by the module
*******************************************************************************/

/* The local variable used to store a scan period */
extern volatile uint16 `$INSTANCE_NAME`_csxScanPeriod;

/* The local variable used to return raw count from post scan ISR */
extern volatile uint16 `$INSTANCE_NAME`_csxRawCount;

/* The pointer to the function used to register a callback in ISR */
extern void (* `$INSTANCE_NAME`_CSXPostScanApiPtr)(void);


/***************************************
* API Constants
***************************************/
#define `$INSTANCE_NAME`_CSX_DEADBAND_CYCLES_NUMBER             (2u)

/* The definition of the time interval is long enough for charging a 100-nF capacitor */
#define `$INSTANCE_NAME`_CSX_MAX_CHARGE_TIME_US                 (100u)
#define `$INSTANCE_NAME`_CSX_AVG_CYCLES_PER_LOOP                (5u)
#define `$INSTANCE_NAME`_CSX_PRECHARGE_WATCHDOG_CYCLES_NUM      (((`$INSTANCE_NAME`_CPU_CLOCK_FREQ_MHZ) * \
                                                                 (`$INSTANCE_NAME`_CSX_MAX_CHARGE_TIME_US)) / \
                                                                 (`$INSTANCE_NAME`_CSX_AVG_CYCLES_PER_LOOP))

/*******************************************************************************
* Register Configuration
*******************************************************************************/

/*
 * +--------+---------------+--------------------------------------------+-------------------------------------------+
 * |        |               | BLOCK_OFF_AFTER_SCAN=TRUE                  | BLOCK_OFF_AFTER_SCAN=FALSE                |
 * +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
 * |        |               |              MODE                          |              MODE                         |
 * |--------|---------------|--------------------------------------------|-------------------------------------------|
 * |  0     | IREF_SEL      | Select Iref according to IrefSel parameter | Select Iref according to IrefSel parameter|
 * |  8:4   | FILTER_DELAY  | 0x02(2-SampleClk cycles)                   | 0x02(2-SampleClk cycles)                  |
 * |  11:10 | SHIELD_DELAY  | 0x00(Delay Line is OFF)                    | 0x00(Delay Line is OFF)                   |
 * |  12    | SENSE_EN      | 0x00(Disabled. All switches are open)      | 0x01(Enabled. Switches can be closed)     |
 * |  17    | FULL_WAVE     | 0x00(Half Wave Mode)                       | 0x00(Half Wave Mode)                      |
 * |  18    | MUTUAL_CAP    | 0x01(Mutual-cap mode)                      | 0x01(Mutual-cap mode)                     |
 * |  19    | CSX_DUAL_CNT  | 0x01(Use two counters)                     | 0x01(Use two counters)                    |
 * |  24    | DSI_COUNT_SEL | 0x00(CSD-Result on the DSI_COUNT bus)      | 0x00(CSD-Result on DSI_COUNT bus)         |
 * |  25    | DSI_SAMPLE_EN | 0x00(DSI_SAMPLE_IN is disabled)            | 0x00(DSI_SAMPLE_IN is disabled)           |
 * |  26    | SAMPLE_SYNC   | 0x00(Double sync is disabled)              | 0x00(Double sync is disabled)             |
 * |  27    | DSI_SENSE_EN  | 0x00(DSI_SENSE_IN is disabled)             | 0x00(DSI_SENSE_IN is disabled)            |
 * |  30    | LP_MODE       | 0x00(High power mode)                      | 0x00(High power mode)                     |
 * |  31    | ENABLE        | 0x00(Analog part is OFF)                   | 0x01(Analog part is ON)                   |
 * +--------+---------------+--------------------------------------------+-------------------------------------------+*/
#if(`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN)
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_EN_CFG              (0x00000000uL)
#else
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_EN_CFG              (0x80001000uL)
#endif /* (`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_BLOCK_OFF_AFTER_SCAN_EN) */

#if(`$INSTANCE_NAME`_IREF_SRSS != `$INSTANCE_NAME`_CSD_IREF_SOURCE)
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_IREF_CFG            (0x00000001uL)
#else
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_IREF_CFG            (0x00000000uL)
#endif /* (`$INSTANCE_NAME`_IREF_SRSS != `$INSTANCE_NAME`_CSD_IREF_SOURCE) */

#if(`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_LP_MODE_EN)
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_LP_MODE_CFG         (0x40000000uL)
#else
    #define `$INSTANCE_NAME`_CONFIG_DEFAULT_LP_MODE_CFG         (0x00000000uL)
#endif /* (`$INSTANCE_NAME`_DISABLE != `$INSTANCE_NAME`_LP_MODE_EN) */

