simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CapSense_v2_0/API/CapSense_SensingCSX_LL.h
#define `$INSTANCE_NAME`_CONFIG_DEFAULT_FILTER_DELAY_CFG        (0x00000020uL)
#define `$INSTANCE_NAME`_CONFIG_DEFAULT_MUTUAL_CFG              (0x00040000uL)
#define `$INSTANCE_NAME`_CONFIG_DEFAULT_DUAL_CNT_CFG            (0x00080000uL)


#define `$INSTANCE_NAME`_DEFAULT_CSD_CONFIG_CFG                 (`$INSTANCE_NAME`_CONFIG_DEFAULT_IREF_CFG |\
                                                                 `$INSTANCE_NAME`_CONFIG_DEFAULT_FILTER_DELAY_CFG |\
                                                                 `$INSTANCE_NAME`_CONFIG_DEFAULT_MUTUAL_CFG |\
                                                                 `$INSTANCE_NAME`_CONFIG_DEFAULT_DUAL_CNT_CFG |\
                                                                 `$INSTANCE_NAME`_CONFIG_DEFAULT_LP_MODE_CFG |\
                                                                 `$INSTANCE_NAME`_CONFIG_DEFAULT_EN_CFG)


/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x01(Clear CSD End Of Scan interrupt)                                                  |
 * | 2      | INIT          | 0x01(Clear CSD End Of Coarse Init interrupt)                                           |
 * | 8      | ADC_RES       | 0x01(Clear ADC End Of Scan interrupt)                                                  |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_INTR_CFG                   (`$INSTANCE_NAME`_CSD_INTR_ALL_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x00(CSD End Of Scan interrupt is cleared)                                             |
 * | 2      | INIT          | 0x00(CSD End Of Coarse Init interrupt is cleared)                                      |
 * | 8      | ADC_RES       | 0x00(ADC End Of Scan interrupt is cleared)                                             |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_INTR_SET_CFG               (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 1      | SAMPLE        | 0x01(CSD End Of Scan interrupt is masked)                                              |
 * | 2      | INIT          | 0x00(CSD End Of Coarse Init interrupt is cleared)                                       |
 * | 8      | ADC_RES       | 0x00(ADC End Of Scan interrupt is cleared)                                              |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_INTR_MASK_CFG              (`$INSTANCE_NAME`_CSD_INTR_MASK_SAMPLE_MSK)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  0     |  HSCMP_EN     | 0x00(High Speed comparator is disabled)                                                |
 * |  4     |  HSCMP_INVERT | 0x00(High Speed comparator output is not inverted)                                     |
 * |  31    |  AZ_EN        | 0x00(Auto-Zero is disabled)                                                            |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_HSCMP_CFG                  (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  1:0   | PWR_MODE      | 0x00(Amux buffer is disabled)                                                          |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_AMBUF_CFG                  (0x00000000uL)

/* +--------+---------------+------------------------------------------+---------------------------------------------+
 * |        |               |           VDDA >= 2V                     |          VDDA <2V                           |
 * +  BITS  +   FIELD       +------------------------------------------+---------------------------------------------+
 * |        |               |              MODE                        |             MODE                            |
 * |--------|---------------|------------------------------------------|---------------------------------------------|
 * |  0     | REFGEN_EN     | 0x01(Reference generator is enabled)     | 0x01(Reference generator is enabled)        |
 * |  4     | BYPASS        | 0x00(BYPASS mode switch is open)         | 0x00(BYPASS mode switch is open)            |
 * |  5     | VDDA_EN       | 0x00(VDDA mode switch is open)           | 0x00(VDDA mode switch is open)              |
 * |  6     | RES_EN        | 0x01(Resistor string is enabled)         | 0x01(Resistor string is enabled)            |
 * |  12:08 | GAIN          | 0x1F(Gain = 31)                          | 0x00(Gain = 21)                             |
 * |  20:16 | VREFLO_SEL    | 0x00(Open all VREFLO switches)           | 0x00(Open all VREFLO switches)              |
 * |  23    | VREFHI_SEL    | 0x00(Open VREF_LO_INT switch)            | 0x00(Open VREF_LO_INT switch)               |
 * +--------+---------------+------------------------------------------+---------------------------------------------+*/
#if(`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE)
    #define `$INSTANCE_NAME`_REFGEN_DEFAULT_GAIN_CFG            (0x00001F00uL)
#else
    #define `$INSTANCE_NAME`_REFGEN_DEFAULT_GAIN_CFG            (0x00001500uL)
#endif /* (`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE) */

