simplementeUnPorito/PSoC-Proyectos/4.2/PSoC Creator/psoc/content/CyComponentLibrary/CyComponentLibrary.cylib/CapSense_v2_0/API/CapSense_SensingCSX_LL.h
#define  `$INSTANCE_NAME`_REFGEN_DEFAULT_EN_CFG                 (0x00000001uL)
#define  `$INSTANCE_NAME`_REFGEN_DEFAULT_RES_EN_CFG             (0x00000040uL)

#define `$INSTANCE_NAME`_DEFAULT_CSD_REFGEN_CFG                 (`$INSTANCE_NAME`_REFGEN_DEFAULT_EN_CFG |\
                                                                 `$INSTANCE_NAME`_REFGEN_DEFAULT_GAIN_CFG |\
                                                                 `$INSTANCE_NAME`_REFGEN_DEFAULT_RES_EN_CFG)


/* +--------+---------------+------------------------------------------+---------------------------------------------+
 * |        |               |        AUTO_ZERO_EN=TRUE                 |       AUTO_ZERO_EN=FALSE                    |
 * +  BITS  +   FIELD       +------------------------------------------+---------------------------------------------+
 * |        |               |              MODE                        |             MODE                            |
 * |--------|---------------|------------------------------------------|---------------------------------------------|
 * |  0     | CSDCMP_EN     | 0x00(CSD comparator is disabled)         | 0x00(CSD comparator is disabled)            |
 * |  5:04  | POLARITY_SEL  | 0x00(IDAC_A polarity is used)            | 0x00(IDAC_A polarity is used)               |
 * |  9:08  | CMP_PHASE     | 0x03(Comparator activated on both phases)| 0x03(Comparator activated in both phases)   |
 * |  28    | CMP_MODE      | 0x00(CSD mode)                           | 0x00(CSD mode)                              |
 * |  29    | FEEDBACK_MODE | 0x00(Feedback from sampling flip-flop)   | 0x00(Feedback from sampling flip-flop)      |
 * |  31    | AZ_EN         | 0x01(Auto-Zero functionality is enabled) | 0x00(Auto-Zero functionality is disabled)   |
 * +--------+---------------+------------------------------------------+---------------------------------------------+*/
#if(0u != `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_CSDCMP_CFG             (0x80000300uL)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_CSDCMP_CFG             (0x00000300uL)
#endif /* (0u != `$INSTANCE_NAME`_CSX_AUTO_ZERO_EN) */

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 6:0    | VAL           | 0x00(Set IDAC value to "0")                                                            |
 * | 7      | POL_DYN       | 0x01(Set dynamic IDAC polarity)                                                        |
 * | 9:8    | POLARITY      | 0x02(IDAC polarity follows CSD_SENSE signal)                                           |
 * | 11:10  | BAL_MODE      | 0x03(IDAC is enabled in both phases and disabled by CSDCOMP at the end of balancing)   |
 * | 17:16  | LEG1_MODE     | 0x03(Configure LEG1 to CSD dynamic mode)                                               |
 * | 19:18  | LEG2_MODE     | 0x00(LEG2 is disabled)                                                                 |
 * | 21     | DSI_CTRL_EN   | 0x00(IDAC DSI control is disabled)                                                     |
 * | 23:22  | RANGE         | Set range according to Csx0IdacGainV2 parameter value                                  |
 * | 24     | LEG1_EN       | 0x01(Output for LEG1 is enabled)                                                       |
 * | 25     | LEG2_EN       | 0x00(Output for LEG2 is disabled)                                                      |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_IDACA_CFG                  ((0x01030E80uL) | \
                                                                 ((`$INSTANCE_NAME`_CSX_IDAC_GAIN << \
                                                                 CSD_IDACA_RANGE_Pos) & \
                                                                 `$INSTANCE_NAME`_CSD_IDACA_RANGE_MSK))

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 6:0    | VAL           | 0x00(Set IDAC value to "0")                                                            |
 * | 7      | POL_DYN       | 0x00(Set to "0" since IDACB is not used)                                               |
 * | 9:8    | POLARITY      | 0x00(Set to "0" since IDACB is not used)                                               |
 * | 11:10  | BAL_MODE      | 0x00(Set to "0" since IDACB is not used)                                               |
 * | 17:16  | LEG1_MODE     | 0x00(Set to "0" since IDACB is not used)                                               |
 * | 19:18  | LEG2_MODE     | 0x00(Set to "0" since IDACB is not used)                                               |
 * | 21     | DSI_CTRL_EN   | 0x00(Set to "0" since IDACB is not used)                                               |
 * | 23:22  | RANGE         | 0x00(Set to "0" since IDACB is not used)                                               |
 * | 24     | LEG1_EN       | 0x00(Output for LEG2 is disabled)                                                      |
 * | 25     | LEG2_EN       | 0x00(Output for LEG2 is disabled)                                                      |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_IDACB_CFG                  (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * +--------+---------------+----------------------------------------------------------------------------------------+
 * | 1:0    | RES_HCAV      | 0x00(Configure HCAV according to CsxInitShieldSwitchRes parameter)                     |
 * | 3:2    | RES_HCAG      | 0x00(Configure HCAG according to CsxInitShieldSwitchRes parameter)                     |
 * | 5:4    | RES_HCBV      | 0x00(Configure HCBV according to CsxInitShieldSwitchRes parameter)                     |
 * | 7:6    | RES_HCBG      | 0x00(Configure HCBG according to CsxInitShieldSwitchRes parameter)                     |
 * | 17:16  | RES_F1PM      | 0x00(Configure F1PM according to CsxInitSwitchRes parameter)                           |
 * | 19:18  | RES_F2PT      | 0x00(Configure 2PT according to CsxInitSwitchRes parameter)                            |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_RES_CFG                 ((`$INSTANCE_NAME`_CSX_INIT_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCAV_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSX_INIT_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCAG_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSX_INIT_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCBV_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSX_INIT_SHIELD_SWITCH_RES << CSD_SW_RES_RES_HCBG_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSX_INIT_SWITCH_RES << CSD_SW_RES_RES_F1PM_Pos) |\
                                                                 (`$INSTANCE_NAME`_CSX_INIT_SWITCH_RES << CSD_SW_RES_RES_F2PT_Pos))

/* +--------+---------------+--------------------------------------------+-------------------------------------------+
 * |        |               |      TX_CLK_SOURCE=PRSAUTO                 |     TX_CLK_SOURCE!=PRSAUTO                |
 * +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
 * |        |               |              MODE                          |             MODE                          |
 * |--------|---------------|--------------------------------------------|-------------------------------------------|
 * |  11:00 | SENSE_DIV     | Set to CSX_TX_CLK_DIVIDER value            | Set to CSX_TX_CLK_DIVIDER value           |
 * |  18:16 | LFSR_SIZE     | 0x00(Will be reconfigured in Run Time)     | 0x00(Set to "0" since not used)           |
 * |  23:20 | LFSR_SCALE    | 0x00(Will be reconfigured in Run Time)     | Set to CSX_TX_CLK_SOURCE value            |
 * |  24    | LFSR_CLEAR    | 0x00(Will be reconfigured in Run Time)     | 0x00(Will be reconfigured in Run Time)    |
 * |  25    | SEL_LFSR_MSB  | 0x00(Not used for CSX scanning method)     | 0x00(Not used for CSX scanning method)    |
 * |  27:26 | LFSR_BITS     | 0x0C(Use 5 bits. Range=[-16:15])           | 0x0C(Use 5 bits. Range=[-16:15])          |
 * +--------+---------------+-----------------------------+----------------------------------------------------------+*/
#if(`$INSTANCE_NAME`_CSX_TX_CLK_SOURCE != `$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SENSE_PERIOD_CFG       (`$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_BITS_MSK | \
                                                                 (uint32)((uint32)`$INSTANCE_NAME`_CSX_TX_CLK_SOURCE << \
                                                                 `$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_SIZE_POS) | \
                                                                 ((uint32)`$INSTANCE_NAME`_CSX_TX_CLK_DIVIDER & \
                                                                 (uint32)`$INSTANCE_NAME`_CSD_SENSE_PERIOD_SENSE_DIV_MSK))
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SENSE_PERIOD_CFG       (`$INSTANCE_NAME`_CSD_SENSE_PERIOD_LFSR_BITS_MSK | \
                                                                 (`$INSTANCE_NAME`_CSX_TX_CLK_DIVIDER & \
                                                                 `$INSTANCE_NAME`_CSD_SENSE_PERIOD_SENSE_DIV_MSK))
#endif /* (`$INSTANCE_NAME`_CSX_TX_CLK_SOURCE != `$INSTANCE_NAME`_CLK_SOURCE_PRSAUTO) */

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 11:0   | SENSE_WIDTH   | 0x0000(Set to "0" SenseClk cycles)                                                     |
 * | 16     | SENSE_POL     | 0x00(Start with low phase)                                                             |
 * | 18     | OVERLAP_PHI1  | 0x00(Non overlap for Phi1)                                                             |
 * | 19     | OVERLAP_PHI2  | 0x00(Non overlap for Phi2)                                                             |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SENSE_DUTY_CFG             (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 0      | SW_HMPM       | 0x00(HMPM switch is statically open)                                                   |
 * | 4      | SW_HMPT       | 0x00(HMPT switch is statically open)                                                   |
 * | 8      | SW_HMPS       | 0x00(HMPS switch is statically open)                                                   |
 * | 12     | SW_HMMA       | 0x00(HMMA switch is statically open)                                                   |
 * | 16     | SW_HMMB       | 0x00(HMMB switch is statically open)                                                   |
 * | 20     | SW_HMCA       | 0x00(HMCA switch is statically open)                                                   |
 * | 24     | SW_HMCB       | 0x00(HMCB switch is statically open)                                                   |
 * | 28     | SW_HMRH       | 0x00(HMRH switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_HS_P_SEL_CFG            (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 16     | SW_HCCC       | 0x00(HCCC switch is statically open)                                                   |
 * | 20     | SW_HCCD       | 0x00(HCCD switch is statically open)                                                   |
 * | 26:24  | SW_HCRH       | 0x00(HCRH switch is statically open)                                                   |
 * | 30:28  | SW_HCRL       | 0x00(HCRL switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_HS_N_SEL_CFG            (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 2:0    | SW_HCAV       | 0x00(HCAV switch is statically open)                                                   |
 * | 6:4    | SW_HCAG       | 0x00(HCAG switch is statically open)                                                   |
 * | 10:8   | SW_HCBV       | 0x00(HCBV switch is statically open)                                                   |
 * | 14:12  | SW_HCBG       | 0x00(HCBG switch is statically open)                                                   |
 * | 16     | SW_HCCV       | 0x00(HCCV switch is statically open)                                                   |
 * | 20     | SW_HCCG       | 0x00(HCCG switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_SHIELD_SEL_CFG          (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  4     | SW_IRBY       | 0x00(IRBY switch is statically open)                                                   |
 * |  8     | SW_IRLB       | 0x00(IRLB switch is statically open)                                                   |
 * |  12    | SW_ICA        | 0x00(ICA  switch is statically open)                                                   |
 * |  18:16 | SW_ICB        | 0x00(ICB  switch is statically open)                                                   |
 * |  20    | SW_IRLI       | 0x00(IRLI switch is statically open)                                                   |
 * |  24    | SW_IRH        | 0x00(IRH  switch is statically open)                                                   |
 * |  28    | SW_IRL        | 0x00(IRL  switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_AMUXBUF_SEL_CFG         (0x00000000uL)


/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 12     | SW_BYA        | 0x01(BYA switch is statically open)                                                    |
 * | 16     | SW_BYB        | 0x00(BYB switch is statically open)                                                    |
 * | 20     | SW_CBCC       | 0x00(CBCC switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_BYP_SEL_CFG             (0x00000000uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 2:0    | SW_SFPM       | 0x03(SFPM switch is controlled by Phi2 of SenseClk signal)                             |
 * | 6:4    | SW_SFPT       | 0x02(SFPM switch is controlled by Phi1 of the SenseClk signal)                         |
 * | 10:8   | SW_SFPS       | 0x00(SFPS switch is statically open)                                                   |
 * | 12     | SW_SFMA       | 0x00(SFMA switch is statically open)                                                   |
 * | 16     | SW_SFMB       | 0x00(SFMB switch is statically open)                                                   |
 * | 20     | SW_SFCA       | 0x00(SFCA switch is statically open)                                                   |
 * | 24     | SW_SFCB       | 0x00(SFCB switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_CMP_P_SEL_CFG           (0x00000023uL)

/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * |  26:24 | SW_SCRH       |  0x01(SFPS switch is statically closed)                                                |
 * |  30:28 | SW_SCRL       |  0x00(SFPS switch is statically open)                                                  |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_CMP_N_SEL_CFG           (0x01000000uL)

/* +--------+---------------+--------------------------------------------+-------------------------------------------+
 * |        |               |             VREF_SRC=SRSS                  |              VREF_SRC=PASS                |
 * +  BITS  +   FIELD       +--------------------------------------------+-------------------------------------------+
 * |        |               |              MODE                          |              MODE                         |
 * |--------|---------------|--------------------------------------------|-------------------------------------------|
 * |  0     | SW_IAIB       | 0x00(IAIB switch is statically open)       | 0x00(IAIB switch is statically open)      |
 * |  4     | SW_IBCB       | 0x00(IBCB switch is statically open)       | 0x00(IBCB switch is statically open)      |
 * |  16    | SW_SGMB       | 0x00(SGMB switch is statically open)       | 0x00(SGMB switch is statically open)      |
 * |  20    | SW_SGRP       | 0x00(SGRP switch is statically open)       | 0x01(SGRP switch is statically closed)    |
 * |  24    | SW_SGRE       | 0x00(SGRE switch is statically open)       | 0x00(SGRE switch is statically open)      |
 * |  28    | SW_SGR        | 0x01(SGR switch is statically closed)      | 0x00(SGR switch is statically open)       |
 * +--------+---------------+--------------------------------------------+-------------------------------------------+*/
#if(`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE)
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SW_REFGEN_SEL_CFG      (0x00100000uL)
#else
    #define `$INSTANCE_NAME`_DEFAULT_CSD_SW_REFGEN_SEL_CFG      (0x10000000uL)
#endif /* (`$INSTANCE_NAME`_VREF_SRSS != `$INSTANCE_NAME`_CSD_VREF_SOURCE) */

#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_REFGEN_SEL_MSK          (0x10100000uL)
/* +--------+---------------+----------------------------------------------------------------------------------------+
 * |  BITS  |   FIELD       |              MODE                                                                      |
 * |--------|---------------|----------------------------------------------------------------------------------------|
 * | 0      | SW_F1PM       | 0x00(F1PM switch is statically closed)                                                 |
 * | 10:8   | SW_F1MA       | 0x00(F1MA switch is controlled by Phi2 of SenseClk signal)                             |
 * | 18:16  | SW_F1CA       | 0x00(F1CA switch is controlled by Phi2 of SenseClk signal)                             |
 * | 20     | SW_C1CC       | 0x00(C1CC switch is statically open)                                                   |
 * | 24     | SW_C1CD       | 0x00(C1CD switch is statically open)                                                   |
 * | 28     | SW_C1F1       | 0x00(C1F1 switch is statically open)                                                   |
 * +--------+---------------+----------------------------------------------------------------------------------------+*/
#define `$INSTANCE_NAME`_DEFAULT_CSD_SW_FW_MOD_SEL_CFG          (0x00030301uL)

